In [425]:
import pandas as pd

In [426]:
import pandas as pd

sheet_id = "1C2BxhoeocM0p-NAiRCT-pzzSU8sAnoZPwRyebqIhWog"
gid = 0  # primeira aba

url = f"https://docs.google.com/spreadsheets/d/{sheet_id}/export?format=csv&gid={gid}"

df = pd.read_csv(url)

In [427]:
df

         data vendedor          cidade   produto  quantidade  preco
0  05/01/2024      Ana       São Paulo  Notebook           2   3500
1  06/01/2024    Bruno  Rio de Janeiro     Mouse           5     80
2  07/01/2024      Ana       São Paulo   Teclado           3    150
3  08/01/2024   Carlos  Belo Horizonte  Notebook           1   4000
4  09/01/2024    Bruno  Rio de Janeiro   Monitor           2   1200
5  10/01/2024      Ana       São Paulo     Mouse           4     80

# 1️⃣ Inspeção inicial (primeiros comandos SEMPRE)

In [428]:
df.head()

         data vendedor          cidade   produto  quantidade  preco
0  05/01/2024      Ana       São Paulo  Notebook           2   3500
1  06/01/2024    Bruno  Rio de Janeiro     Mouse           5     80
2  07/01/2024      Ana       São Paulo   Teclado           3    150
3  08/01/2024   Carlos  Belo Horizonte  Notebook           1   4000
4  09/01/2024    Bruno  Rio de Janeiro   Monitor           2   1200

In [429]:
df.tail()

         data vendedor          cidade   produto  quantidade  preco
1  06/01/2024    Bruno  Rio de Janeiro     Mouse           5     80
2  07/01/2024      Ana       São Paulo   Teclado           3    150
3  08/01/2024   Carlos  Belo Horizonte  Notebook           1   4000
4  09/01/2024    Bruno  Rio de Janeiro   Monitor           2   1200
5  10/01/2024      Ana       São Paulo     Mouse           4     80

In [430]:
df.shape

(6, 6)

In [431]:
df.columns

Index(['data', 'vendedor', 'cidade', 'produto', 'quantidade', 'preco'], dtype='object')

In [432]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   data        6 non-null      object
 1   vendedor    6 non-null      object
 2   cidade      6 non-null      object
 3   produto     6 non-null      object
 4   quantidade  6 non-null      int64
 5   preco       6 non-null      int64
dtypes: int64(2), object(4)
memory usage: 420.0+ bytes

In [433]:
df.describe()

       quantidade        preco
count    6.000000     6.000000
mean     2.833333  1501.666667
std      1.471960  1799.737944
min      1.000000    80.000000
25%      2.000000    97.500000
50%      2.500000   675.000000
75%      3.750000  2925.000000
max      5.000000  4000.000000

# 2️⃣ Seleção de colunas

In [434]:
df["produto"]

0    Notebook
1       Mouse
2     Teclado
3    Notebook
4     Monitor
5       Mouse
Name: produto, dtype: object

In [435]:
df[["produto", "preco"]]

    produto  preco
0  Notebook   3500
1     Mouse     80
2   Teclado    150
3  Notebook   4000
4   Monitor   1200
5     Mouse     80

In [436]:
colunas = ["produto", "preco"]
df_copy = df[colunas]

df_copy.head()

    produto  preco
0  Notebook   3500
1     Mouse     80
2   Teclado    150
3  Notebook   4000
4   Monitor   1200

# 4️⃣ Filtros

In [437]:
df[df["quantidade"] > 2]

         data vendedor          cidade  produto  quantidade  preco
1  06/01/2024    Bruno  Rio de Janeiro    Mouse           5     80
2  07/01/2024      Ana       São Paulo  Teclado           3    150
5  10/01/2024      Ana       São Paulo    Mouse           4     80

In [438]:
df[(df["cidade"] == "São Paulo") & (df["preco"] > 1000)]

         data vendedor     cidade   produto  quantidade  preco
0  05/01/2024      Ana  São Paulo  Notebook           2   3500

In [439]:
df[df["produto"].isin(["Notebook", "Monitor"])]

         data vendedor          cidade   produto  quantidade  preco
0  05/01/2024      Ana       São Paulo  Notebook           2   3500
3  08/01/2024   Carlos  Belo Horizonte  Notebook           1   4000
4  09/01/2024    Bruno  Rio de Janeiro   Monitor           2   1200

# 5️⃣ Criando colunas novas (transformação)

In [440]:
df["total"] = df["quantidade"] * df["preco"]
df.head()

         data vendedor          cidade   produto  quantidade  preco  total
0  05/01/2024      Ana       São Paulo  Notebook           2   3500   7000
1  06/01/2024    Bruno  Rio de Janeiro     Mouse           5     80    400
2  07/01/2024      Ana       São Paulo   Teclado           3    150    450
3  08/01/2024   Carlos  Belo Horizonte  Notebook           1   4000   4000
4  09/01/2024    Bruno  Rio de Janeiro   Monitor           2   1200   2400

In [441]:
import datetime 
df['data'] = pd.to_datetime(df['data'], format='%d/%m/%Y')  # Para formato dd/mm/yyyy
df["ano"] = df["data"].dt.year
df["mes"] = df["data"].dt.month
df.head()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,São Paulo,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,Rio de Janeiro,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,São Paulo,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,Belo Horizonte,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,Rio de Janeiro,Monitor,2,1200,2400,2024,1

# 6️⃣ Alterando valores

In [442]:
df["cidade"] = df["cidade"].str.upper()
df.head()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1

In [443]:
df.loc[df["quantidade"] == 0, "quantidade"] = 1
df.head()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1

# 7️⃣ Ordenação

In [444]:
df.sort_values("preco")

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
5,2024-01-10,Ana,SÃO PAULO,Mouse,4,80,320,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1

In [445]:
df.sort_values("preco", ascending=False)

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
5,2024-01-10,Ana,SÃO PAULO,Mouse,4,80,320,2024,1

# 8️⃣ Agrupamentos (groupby)

In [446]:
df.groupby("vendedor")["total"].sum()

vendedor
Ana       7770
Bruno     2800
Carlos    4000
Name: total, dtype: int64

In [447]:
df.groupby("produto")["quantidade"].sum()

produto
Monitor     2
Mouse       9
Notebook    3
Teclado     3
Name: quantidade, dtype: int64

In [448]:
df.groupby("cidade").agg({
    "total": "sum",
    "quantidade": "mean"
})

                total  quantidade
cidade
BELO HORIZONTE   4000         1.0
RIO DE JANEIRO   2800         3.5
SÃO PAULO        7770         3.0

# 🔟 Valores nulos

In [449]:
df.isna().sum()

data          0
vendedor      0
cidade        0
produto       0
quantidade    0
preco         0
total         0
ano           0
mes           0
dtype: int64

In [450]:
df.fillna(0)

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1
5,2024-01-10,Ana,SÃO PAULO,Mouse,4,80,320,2024,1

In [451]:
df.dropna()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1
5,2024-01-10,Ana,SÃO PAULO,Mouse,4,80,320,2024,1

# 1️⃣1️⃣ Conversão de tipos

In [452]:
df["data"] = pd.to_datetime(df["data"])
df.head()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1

In [453]:
df["quantidade"] = df["quantidade"].astype(int)
df.head()

,data,vendedor,cidade,produto,quantidade,preco,total,ano,mes
0,2024-01-05,Ana,SÃO PAULO,Notebook,2,3500,7000,2024,1
1,2024-01-06,Bruno,RIO DE JANEIRO,Mouse,5,80,400,2024,1
2,2024-01-07,Ana,SÃO PAULO,Teclado,3,150,450,2024,1
3,2024-01-08,Carlos,BELO HORIZONTE,Notebook,1,4000,4000,2024,1
4,2024-01-09,Bruno,RIO DE JANEIRO,Monitor,2,1200,2400,2024,1

# 1️⃣2️⃣ Renomear colunas

In [454]:
df.rename(columns={
    "Preco Unitario": "preco"
}, inplace=True)

# 1️⃣3️⃣ Exportar dados

In [455]:
from pathlib import Path

# volta uma pasta e entra em data/
caminho = Path("..") / "data"

# garante que a pasta existe
caminho.mkdir(parents=True, exist_ok=True)

In [456]:
df.to_excel(caminho / "resultado.xlsx", index=False)

In [457]:
df.to_csv(caminho / "resultado.csv", index=False, sep=";", encoding="utf-8")